// Демонстрация решения
// Напишите программу, которая 
// 1. на вход// принимает число 
// 2. выдаёт его квадрат (число умноженное на само себя).
// 3. Вывод результата

// Например:
// 4 -> 16
// -3 -> 9
// -7 -> 49

Console.Write("Введите целое число: ");
int number = Convert.ToInt32(Console.ReadLine ());
int square = number * number;
Console.WriteLine($"Квадрат числа {number} = {square}");

// Double number1 = Convert.ToDouble(Console.ReadLine ());
// double d = 4.545;
// string str = "jgkjkj15353//...";
// string str1 = Console.ReadLine ();